In [2]:
import numpy as np
import pandas as pd

# Data Frame

In [34]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]
 
columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [51]:
df = pd.DataFrame(data, columns=columns) #explicitly assign 'columns', the default second param is an index array
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [52]:
df.head(3) # returns first n rows, default 5

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990

---

# Series

In [53]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

DataFrame is a list of dictionary, where dictionary terms contains all rows' corresponding values

In [54]:
df.Make

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [55]:
df['Engine Cylinders']

0    4
1    4
2    4
3    4
4    6
Name: Engine Cylinders, dtype: int64

In [56]:
df[['Make', 'Year', 'MSRP']]

      Make  Year   MSRP
0   Nissan  1991   2000
1  Hyundai  2017  27150
2    Lotus  2010  54990
3      GMC  2017  34450
4   Nissan  2017  32340

Series are numpy arrays, so array operations work too

In [57]:
df['Engine Cylinders'] * 2

0     8
1     8
2     8
3     8
4    12
Name: Engine Cylinders, dtype: int64

In [58]:
df.shape

(5, 8)

In [59]:
df['id'] = (np.arange(0, df.shape[0]) + 1) * 10

In [60]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,10
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,20
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,30
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,40
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,50

In [61]:
del df['id']

In [62]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

---

# Index

In [126]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [127]:
df.index = ['a', 'b', 'c', 'd', 'e']

In [128]:
df

,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
a,a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
b,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
c,c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
d,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
e,e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [129]:
df.Make.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [130]:
df.Make.loc[['a', 'c', 'e']] # key value

a    Nissan
c     Lotus
e    Nissan
Name: Make, dtype: object

In [131]:
df.Make.iloc[[0, 2, 4]] # positional index

a    Nissan
c     Lotus
e    Nissan
Name: Make, dtype: object

In [138]:
df.reset_index() # set drop=True to exclude level_0 series

,level_0,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,0,a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,1,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,2,c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,3,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,4,e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [139]:
df = df.reset_index(drop=True) # assign operator, the function returns a new dataframe

In [140]:
df

,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

---

# Element-wise operations

In [142]:
df['Engine HP'] / 100

0    1.38
1     NaN
2    2.18
3    1.94
4    2.61
Name: Engine HP, dtype: float64

In [143]:
df['Year'] >= 2015

0    False
1     True
2    False
3     True
4     True
Name: Year, dtype: bool

---

# Filtering

In [154]:
df[df['Year'] >= 2015]

,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [156]:
df[(df['Year'] >= 2015) & (df['Make'] == 'Nissan')]

,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
4,e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [150]:
df[ [False, True, False, True, True] ]

,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [161]:
df['Year']

0    1991
1    2017
2    2010
3    2017
4    2017
Name: Year, dtype: int64

In [157]:
df['Year'] >= 2015

0    False
1     True
2    False
3     True
4     True
Name: Year, dtype: bool

In [147]:
df['Year'][df['Year'] >= 2015]

1    2017
3    2017
4    2017
Name: Year, dtype: int64

---

# String operations

In [163]:
'HaEriN'.lower()

'haerin'

In [164]:
'Hanni and Minji'.replace(' ', '_')

'Hanni_and_Minji'

In [172]:
df['Vehicle_Style'] = df['Vehicle_Style'].str.lower().str.replace(' ', '_') # use assign operator

In [173]:
df

,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150
2,c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr_suv,34450
4,e,Nissan,Frontier,2017,261.0,6,MANUAL,pickup,32340

---

# Summarizing operations

In [174]:
df.MSRP.max()

54990

In [178]:
df.MSRP.describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: MSRP, dtype: float64

In [179]:
df.describe().round(2)

          Year  Engine HP  Engine Cylinders      MSRP
count     5.00       4.00              5.00      5.00
mean   2010.40     202.75              4.40  30186.00
std      11.26      51.30              0.89  18985.04
min    1991.00     138.00              4.00   2000.00
25%    2010.00     180.00              4.00  27150.00
50%    2017.00     206.00              4.00  32340.00
75%    2017.00     228.75              4.00  34450.00
max    2017.00     261.00              6.00  54990.00

In [181]:
df.Make.nunique()

4

In [182]:
df.nunique()

index                5
Make                 4
Model                5
Year                 3
Engine HP            4
Engine Cylinders     2
Transmission Type    2
Vehicle_Style        4
MSRP                 5
dtype: int64

---

# Missing values

In [184]:
df.isnull()

,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,True,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False

In [194]:
df.isnull().sum()

index                0
Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle_Style        0
MSRP                 0
dtype: int64

---

# Grouping

In [203]:
df.groupby('Transmission Type').MSRP.mean().round(2)

Transmission Type
AUTOMATIC    30800.00
MANUAL       29776.67
Name: MSRP, dtype: float64

---

# Getting NumPy arrays

In [205]:
df.MSRP

0     2000
1    27150
2    54990
3    34450
4    32340
Name: MSRP, dtype: int64

In [207]:
df.MSRP.values

array([ 2000, 27150, 54990, 34450, 32340], dtype=int64)

In [213]:
df.to_dict(orient='records')

[{'index': 'a',
  'Make': 'Nissan',
  'Model': 'Stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'sedan',
  'MSRP': 2000},
 {'index': 'b',
  'Make': 'Hyundai',
  'Model': 'Sonata',
  'Year': 2017,
  'Engine HP': nan,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': 'sedan',
  'MSRP': 27150},
 {'index': 'c',
  'Make': 'Lotus',
  'Model': 'Elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'convertible',
  'MSRP': 54990},
 {'index': 'd',
  'Make': 'GMC',
  'Model': 'Acadia',
  'Year': 2017,
  'Engine HP': 194.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': '4dr_suv',
  'MSRP': 34450},
 {'index': 'e',
  'Make': 'Nissan',
  'Model': 'Frontier',
  'Year': 2017,
  'Engine HP': 261.0,
  'Engine Cylinders': 6,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'pickup',
  'MSRP': 32340}]